１３章/Booksersでjava練習/app/controllers/books_controller.rb

  def create
  	@book = Book.new(book_params)
    if @book.save
       redirect_to book_path(@book.id), notice: 'Book was successfully created'
    else
       @books = Book.all
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "a"], ["body", "a"], ["created_at", "2020-04-04 05:22:35.465768"], ["updated_at", "2020-04-04 05:22:35.465768"]]
SELECT "books".* FROM "books"